// 银行卡号识别对应银行信息
export const BANKLIST = [
  { value: '310290000013', label: '上海浦东发展银行' },
  { value: '102100099996', label: '中国工商银行' },
  { value: '103100000026', label: '中国农业银行' },
  { value: '104100000004', label: '中国银行' },
  { value: '105100000017', label: '中国建设银行' },
  { value: '301290000007', label: '交通银行' },
  { value: '302100011000', label: '中信银行' },
  { value: '303100000006', label: '光大银行' },
  { value: '304100040000', label: '华夏银行' },
  { value: '305100000013', label: '中国民生银行' },
  { value: '306581000003', label: '广发银行' },
  { value: '307584007998', label: '深圳发展银行' },
  { value: '308584000013', label: '招商银行' },
  { value: '309391000011', label: '兴业银行' },
  { value: '313100000013', label: '北京银行' },
  { value: '313110000017', label: '天津银行' },
  { value: '313121006888', label: '河北银行股份有限公司' },
  { value: '313205057830', label: '鄂尔多斯银行' },
  { value: '313222080002', label: '大连银行' },
  { value: '313223007007', label: '鞍山市商业银行' }, // 暂无
  { value: '313227000012', label: '锦州银行' },
  { value: '313227600018', label: '葫芦岛银行' },
  { value: '313228000276', label: '营口银行' },
  { value: '313229000008', label: '阜新银行结算中心' }, // 暂无
  { value: '313241066661', label: '吉林银行' },
  { value: '313261000018', label: '哈尔滨银行结算中心' }, // 暂无
  { value: '313261099913', label: '龙江银行' },
  { value: '313290000017', label: '上海银行' },
  { value: '313301008887', label: '南京银行' },
  { value: '313301099999', label: '江苏银行股份有限公司' }, // 暂无
  { value: '313305066661', label: '苏州银行' },
  { value: '313312300018', label: '江苏长江商行' }, // 暂无
  { value: '313331000014', label: '杭州银行' },
  { value: '313332082914', label: '宁波银行' },
  { value: '313333007331', label: '温州银行' },
  { value: '313335081005', label: '嘉兴银行清算中心' }, // 暂无
  { value: '313336071575', label: '湖州银行' },
  { value: '313337009004', label: '绍兴银行' },
  { value: '313338707013', label: '浙江稠州商业银行' },
  { value: '313345001665', label: '台州银行' },
  { value: '313345010019', label: '浙江泰隆商业银行' },
  { value: '313345400010', label: '浙江民泰商业银行' },
  { value: '313391080007', label: '福建海峡银行' },
  { value: '313393080005', label: '厦门银行' },
  { value: '313397075189', label: '泉州银行' },
  { value: '313421087506', label: '南昌银行' },
  { value: '313424076706', label: '九江银行股份有限公司' }, // 暂无
  { value: '313428076517', label: '赣州银行' },
  { value: '313433076801', label: '上饶银行' },
  { value: '313451000019', label: '齐鲁银行' },
  { value: '313452060150', label: '青岛银行' },
  { value: '313453001017', label: '齐商银行' },
  { value: '313454000016', label: '枣庄银行' },
  { value: '313455000018', label: '东营银行' },
  { value: '313456000108', label: '烟台银行' },
  { value: '313458000013', label: '潍坊银行' },
  { value: '313461000012', label: '济宁银行' },
  { value: '313463000993', label: '泰安市商业银行' },
  { value: '313463400019', label: '莱商银行' },
  { value: '313465000010', label: '威海市商业银行' },
  { value: '313468000015', label: '德州银行' },
  { value: '313473070018', label: '临商银行' },
  { value: '313473200011', label: '日照银行' },
  { value: '313491000232', label: '郑州银行' },
  { value: '313491099996', label: '中原银行' },
  { value: '313493080539', label: '洛阳银行' },
  { value: '313495081900', label: '平顶山银行' },
  { value: '313504000010', label: '漯河市商业银行' },
  { value: '313506082510', label: '商丘市商业银行' },
  { value: '313521000011', label: '汉口银行' },
  { value: '313521006000', label: '湖北银行' },
  { value: '313551088886', label: '长沙银行' },
  { value: '313581003284', label: '广州银行' },
  { value: '313584099990', label: '平安银行' },
  { value: '313585000990', label: '珠海华润银行清算中心' }, // 暂无
  { value: '313586000006', label: '广东华兴银行' },
  { value: '313591001001', label: '广东南粤银行股份有限公司' },
  { value: '313602088017', label: '东莞银行' },
  { value: '313611001018', label: '广西北部湾银行' },
  { value: '313614000012', label: '柳州银行' },
  { value: '313617000018', label: '桂林银行股份有限公司' }, // 暂无
  { value: '313651099999', label: '成都银行' },
  { value: '313653000013', label: '重庆银行股份有限公司' }, // 暂无
  { value: '313655091983', label: '自贡市商业银行清算中心' }, // 暂无
  { value: '313656000019', label: '攀枝花市商业银行' },
  { value: '313658000014', label: '德阳银行' },
  { value: '313659000016', label: '绵阳市商业银行' },
  { value: '313673093259', label: '南充市商业银行' },
  { value: '313701098010', label: '贵阳银行' },
  { value: '313731010015', label: '富滇银行' },
  { value: '313791000015', label: '西安银行' },
  { value: '313791030003', label: '长安银行' },
  { value: '313821001016', label: '兰州银行股份有限公司' }, // 暂无
  { value: '313851000018', label: '青海银行' },
  { value: '313871000007', label: '宁夏银行' },
  { value: '313881000002', label: '乌鲁木齐市商业银行' },
  { value: '313882000012', label: '昆仑银行' },
  { value: '314302200018', label: '江阴农商银行' },
  { value: '314305106644', label: '太仓农商行' }, // 暂无
  { value: '314305206650', label: '昆山农村商业银行' },
  { value: '314305400015', label: '吴江农村商业银行' },
  { value: '314305506621', label: '常熟农村商业银行' },
  { value: '314305670002', label: '张家港农村商业银行' },
  { value: '314581000011', label: '广州农村商业银行' },
  { value: '314588000016', label: '顺德农村商业银行' },
  { value: '314641000014', label: '海口联合农村商业银行' }, // 暂无
  { value: '314653000011', label: '重庆农村商业银行' },
  { value: '315456000105', label: '恒丰银行' },
  { value: '316331000018', label: '浙商银行' },
  { value: '317110010019', label: '天津农商银行' },
  { value: '318110000014', label: '渤海银行' },
  { value: '319361000013', label: '徽商银行' },
  { value: '320100010011', label: '北京顺义银座村镇银行' },
  { value: '320343800019', label: '浙江景宁银座村镇银行' }, // 暂无
  { value: '320345790018', label: '浙江三门银座村镇银行' }, // 暂无
  { value: '320428090311', label: '江西赣州银座村镇银行' }, // 暂无
  { value: '320584002002', label: '深圳福田银座村镇银行' }, // 暂无
  { value: '320653000104', label: '重庆渝北银座村镇银行' }, // 暂无
  { value: '320687000016', label: '重庆黔江银座村镇银行' }, // 暂无
  { value: '322290000011', label: '上海农商银行' },
  { value: '402100000018', label: '北京农村商业银行' },
  { value: '402241000015', label: '吉林农村信用社' },
  { value: '402301099998', label: '江苏省农村信用社联合社' },
  { value: '402331000007', label: '浙江省农村信用社' },
  { value: '402332010004', label: '鄞州银行' },
  { value: '402361018886', label: '安徽省农村信用社联合社' },
  { value: '402391000068', label: '福建省农村信用社' },
  { value: '402451000010', label: '山东省农联社' }, // 暂无
  { value: '402521000032', label: '湖北农信' }, // 暂无
  { value: '402584009991', label: '深圳农商行' }, // 暂无
  { value: '402602000018', label: '东莞农村商业银行' },
  { value: '402611099974', label: '广西农村信用社（合作银行）' },
  { value: '402641000014', label: '海南省农村信用社' },
  { value: '402651020006', label: '四川省联社' }, // 暂无
  { value: '402731057238', label: '云南省农村信用社' },
  { value: '402871099996', label: '黄河农村商业银行' },
  { value: '403100000004', label: '中国邮政储蓄银行' },
  { value: '502290000006', label: '东亚银行（中国）有限公司' }, // 暂无
  { value: '593100000020', label: '友利银行' },
  { value: '595100000007', label: '新韩银行中国' }, // 暂无
  { value: '596110000013', label: '企业银行' },
  { value: '597100000014', label: '韩亚银行' },
  { value: '531290088881', label: '花旗银行（中国）有限公司' },
  { value: '501290000012', label: '汇丰银行上海分行' },
  { value: '501100000011', label: '汇丰银行北京分行' },
  { value: '501521000017', label: '汇丰银行武汉分行' },
  { value: '501581000004', label: '汇丰银行广州分行' },
  { value: '313651060088', label: '成都银行彭州支行' }
];

export const SAAS_BANK_LIST = [
  { value: '102100099996', label: '中国工商银行' },
  { value: '301290000007', label: '交通银行' },
  { value: '104100000004', label: '中国银行' },
  { value: '105100000017', label: '中国建设银行' },
  { value: '309391000011', label: '兴业银行' },
  { value: '302100011000', label: '中信银行' },
  { value: '306581000003', label: '广发银行' },
  { value: '313584099990', label: '平安银行' },
  { value: '310290000013', label: '上海浦东发展银行' },
  { value: '304100040000', label: '华夏银行' },
  { value: '403100000004', label: '中国邮政储蓄银行' },
  { value: '103100000026', label: '中国农业银行' },
  { value: '308584000013', label: '招商银行' },
  { value: '313290000017', label: '上海银行' },
  { value: '305100000013', label: '中国民生银行' },
  { value: '303100000006', label: '光大银行' },
  { value: '313100000013', label: '北京银行' },
  { value: '313332082914', label: '宁波银行' }
];
