// 借款用途
export const LOANS_PURPOSE_LIST = [
  { value: '01', name: '合法生产经营活动' },
  { value: '02', name: '购置或更新经营设备' },
  { value: '03', name: '支付租赁经营场所租金' },
  { value: '04', name: '经营场所装修所需的周转资金' },
  { value: '99', name: '其他' }
  // 01_合法生产经营活动,02_购置或更新经营设备,03_支付租赁经营场所租金,04_经营场所装修所需的周转资金,99_其他
];

// 借款期限  3/6/9/12可以给客户选择
export const LOANS_TREM_TIMES = [
  // { value: '1个月', name: '1个月' },
  // { value: '2个月', name: '2个月' },
  { value: '3', name: '3个月' },
  // { value: '4个月', name: '4个月' },
  // { value: '5个月', name: '5个月' },
  { value: '6', name: '6个月' },
  // { value: '7个月', name: '7个月' },
  // { value: '8个月', name: '8个月' },
  { value: '9', name: '9个月' },
  // { value: '10个月', name: '10个月' },
  // { value: '11个月', name: '11个月' },
  { value: '12', name: '12个月' }
];

export const LOANS_TREM_TIMES_CP = [
  { value: '1个月', name: '1个月' },
  { value: '2个月', name: '2个月' },
  { value: '3个月', name: '3个月' }
];

// 还款方式
export const LOANS_REFUND_TYPE = [
  { value: '01', name: '按期结息一次性还本' },
  { value: '02', name: '到期一次还本付息（利随本清）' },
  { value: '03', name: '按月等额本金' },
  { value: '04', name: '按月等额本息' },
  { value: '05', name: '气球还款法' }

  //  当前只是暂时只允许传 04.按月等额本息

  // 01.按期结息一次性还本 ,02.到期一次还本付息（利随本清）,03.按月等额本金,04.按月等额本息,05.气球还款法；
];

// 还本周期:默认只能传4   1-一次性,2-单周(自然周),3-双周(两个连续自然周),4-按月,5-按季,6-半年,7-按年
export const LOANS_PRINC_CYCLE = [
  // 当前暂时只允许传 4
  { value: '1', name: '一次性' },
  { value: '2', name: '单周(自然周)' },
  { value: '3', name: '双周(两个连续自然周)' },
  { value: '4', name: '按月' },
  { value: '5', name: '按季' },
  { value: '6', name: '半年' },
  { value: '7', name: '按年' }
];

// 还息周期:默认只能传4   1-一次性,2-单周(自然周),3-双周(两个连续自然周),4-按月,5-按季,6-半年,7-按年
export const LOANS_INTEREST_CYCLE = [
  // 当前暂时只允许传 4
  { value: '1', name: '一次性' },
  { value: '2', name: '单周(自然周)' },
  { value: '3', name: '双周(两个连续自然周)' },
  { value: '4', name: '按月' },
  { value: '5', name: '按季' },
  { value: '6', name: '半年' },
  { value: '7', name: '按年' }
];

export const LOANS_TREM_PROTOCOL = {
  '1个月': '1',
  '2个月': '2',
  '3个月': '3',
  '4个月': '4',
  '5个月': '5',
  '6个月': '6',
  '7个月': '7',
  '8个月': '8',
  '9个月': '9',
  '10个月': '10',
  '11个月': '11',
  '1年': '12'
};

export const LOANS_REOUND = {
  '01': '等额本息',
  '02': '等额本金',
  '04': '按期付息一次性还本'
};

export const CONFIRM_LOANS_PURPOSE = {
  '1': '个人经营',
  '2': '个人消费',
  a: '住房装修',
  b: '购房',
  c: '教育支出',
  d: '旅游',
  e: '购耐用消费品',
  f: '其他'
};
export const CONFIRM_LOANS_REFUND_TYPE = {
  '01': '等额本息',
  '02': '等额本金',
  '03': '一次性还款付息',
  '04': '按期付息一次性还本'
};

export const WARN_TEXT =
  '尊敬的小微E秒贷客户：借款申请流程中，请勿向任何人及任何公司支付假借帮助您申请贷款收取的任何其他服务费用。您申请的贷款将直接发放至您个人账户，由您自主自愿支付用于个人日常经营，谨防诈骗。如有任何疑点，请第一时间拨打小萌金融服务热线：021-66198090（工作时间：工作日9:30-18:30）';

export const WARN_TEXT_BYPROD = {
  1000: '尊敬的小萌快贷客户：除您签署的担保和借款合同约定的费用外，请勿向任何人及任何公司支付假借帮助您申请贷款收取的任何其他服务费用。您申请的贷款将直接发放至您个人账户，由您自主自愿支付用于个人日常经营，谨防诈骗。如有任何疑点，请第一时间拨打小萌金融服务热线：021-66198090（工作时间：工作日9:30-18:30）。',
  1023: '尊敬的中关村客户：除您签署的担保和借款合同约定的费用外，请勿向任何人及任何公司支付假借帮助您申请贷款收取的任何其他服务费用。您申请的贷款将直接发放至您个人账户，由您自主自愿支付用于个人日常经营，谨防诈骗。如有任何疑点，请第一时间拨打小萌金融服务热线：021-66198090（工作时间：工作日9:30-18:30）。'
};
