export const LOANS_PURPOSE_LIST = [
  { value: "1", label: "个人经营" },
  // { value: "2", label: "个人消费" },
  // { value: "a", label: "住房装修" },
  // { value: "b", label: "购房" },
  // { value: "c", label: "教育支出" },
  // { value: "d", label: "旅游" },
  // { value: "e", label: "购耐用消费品" },
  // { value: "f", label: "其他" }
]

export const LOANS_TREM_TIMES = [
  { value: "1个月", label: "1个月" },
  { value: "2个月", label: "2个月" },
  { value: "3个月", label: "3个月" },
  { value: "4个月", label: "4个月" },
  { value: "5个月", label: "5个月" },
  { value: "6个月", label: "6个月" },
  { value: "7个月", label: "7个月" },
  { value: "8个月", label: "8个月" },
  { value: "9个月", label: "9个月" },
  { value: "10个月", label: "10个月" },
  { value: "11个月", label: "11个月" },
  { value: "1年", label: "12个月" },
]

export const LOANS_TREM_TIMES_CP = [
  { value: "1个月", label: "1个月" },
  { value: "2个月", label: "2个月" },
  { value: "3个月", label: "3个月" },
]

export const LOANS_REFUND_TYPE = [
  { value: "01", label: "等额本息" },
  { value: "02", label: "等额本金" },
  // { value: "03", label: "一次性还款付息" },
  // { value: "04", label: "按期付息一次性还本" }
]

export const LOANS_TREM_PROTOCOL = {
  "1个月": '1',
  "2个月": '2',
  "3个月": '3',
  "4个月": '4',
  "5个月": '5',
  "6个月": '6',
  "7个月": '7',
  "8个月": '8',
  "9个月": '9',
  "10个月": '10',
  "11个月": '11',
  "1年": '12'
}

export const LOANS_REOUND = {
  '01': '等额本息',
  '02': '等额本金',
  '04': '按期付息一次性还本',
}

export const CONFIRM_LOANS_PURPOSE = {
   "1": "个人经营" ,
   "2": "个人消费",
   "a": "住房装修",
   "b": "购房",
   "c": "教育支出",
   "d": "旅游",
   "e": "购耐用消费品",
   "f": "其他"
}
export const CONFIRM_LOANS_REFUND_TYPE = {
  "01": "等额本息" ,
  "02": "等额本金" ,
  "03": "一次性还款付息" ,
  "04": "按期付息一次性还本"
}


export const WARN_TEXT = '尊敬的小萌快贷客户：除您签署的担保和借款合同约定的费用外，请勿向任何人及任何公司支付假借帮助您申请贷款收取的任何其他服务费用。您申请的贷款将直接发放至您个人账户，由您自主自愿支付用于个人日常经营，谨防诈骗。如有任何疑点，请第一时间拨打小萌金融服务热线：021-66198090（工作时间：工作日9:30-18:30）。'


export const WARN_TEXT_BYPROD = {
  1000: '尊敬的小萌快贷客户：除您签署的担保和借款合同约定的费用外，请勿向任何人及任何公司支付假借帮助您申请贷款收取的任何其他服务费用。您申请的贷款将直接发放至您个人账户，由您自主自愿支付用于个人日常经营，谨防诈骗。如有任何疑点，请第一时间拨打小萌金融服务热线：021-66198090（工作时间：工作日9:30-18:30）。',
  1023: '尊敬的中关村客户：除您签署的担保和借款合同约定的费用外，请勿向任何人及任何公司支付假借帮助您申请贷款收取的任何其他服务费用。您申请的贷款将直接发放至您个人账户，由您自主自愿支付用于个人日常经营，谨防诈骗。如有任何疑点，请第一时间拨打小萌金融服务热线：021-66198090（工作时间：工作日9:30-18:30）。'
}